{
  "basics": {
    "name": "Finn Vamosi",
    "label": "Bachelor of Science in Computer Science",
    "image": "",
    "summary": "",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Calgary",
      "countryCode": "CA",
      "region": ""
    },
    "profiles": []
  },
  "work": [],
  "volunteer": [
    {
      "organization": "University of Calgary, Students' Union",
      "location": "",
      "position": "Food Bank Volunteer",
      "url": "",
      "startDate": "2022",
      "endDate": "2024",
      "summary": "",
      "highlights": [
        "Interviewed clients about their personal details and food preferences",
        "Packed hampers according to the specific preferences of clients, and authenticated clients upon arrival",
        "Mentored new volunteers to accelerate the onboarding process"
      ]
    },
    {
      "organization": "CalgaryToSpace (Student team working to launch a satellite into space)",
      "location": "",
      "position": "Communications Team Member",
      "url": "",
      "startDate": "2021",
      "endDate": "2022",
      "summary": "",
      "highlights": [
        "Developed the software framework for transmitting information back and forth between the satellite and our ground station",
        "Constructed web dashboard for displaying satellite telemetry in near real-time",
        "Applied for international clearance to operate within specific radio frequencies"
      ]
    },
    {
      "organization": "William Aberhart High School",
      "location": "",
      "position": "Robotics Team Lead",
      "url": "",
      "startDate": "2020",
      "endDate": "2021",
      "summary": "",
      "highlights": [
        "Redesigned the team's outdated website with a focus on ease of use and accessibility",
        "Implemented control software to ensure robot executed automated tasks correctly, and responded accurately to human control",
        "Delegated tasks according to skill sets and interests, and coordinated meetings to keep development on track"
      ]
    },
    {
      "organization": "Under The GUI Academy (Tutoring organization dedicated to Computer Science education)",
      "location": "",
      "position": "Volunteer Instructor",
      "url": "",
      "startDate": "2020",
      "endDate": "2020",
      "summary": "",
      "highlights": [
        "Taught young children basic programming concepts"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Calgary",
      "location": "Canada",
      "url": "",
      "area": "Computer Science",
      "studyType": "Bachelor of Science",
      "startDate": "2021",
      "endDate": "2025",
      "score": "3.90",
      "courses": []
    },
    {
      "institution": "University of Texas at Austin",
      "location": "USA",
      "url": "",
      "area": "",
      "studyType": "",
      "startDate": "Fall 2024",
      "endDate": "Fall 2024",
      "score": "",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "Data Processing Management Association Prize ($400)",
      "date": "2025",
      "awarder": "",
      "url": "",
      "summary": ""
    },
    {
      "title": "NSERC Undergraduate Student Research Award ($7,500)",
      "date": "2022, 2024, and 2025",
      "awarder": "",
      "url": "",
      "summary": ""
    },
    {
      "title": "Killam Fellowship (USD$6,750)",
      "date": "2024",
      "awarder": "",
      "url": "",
      "summary": ""
    },
    {
      "title": "Jason Lang Scholarship ($1,000)",
      "date": "2023 and 2024",
      "awarder": "",
      "url": "",
      "summary": ""
    },
    {
      "title": "Alberta Innovates Summer Research Studentship ($7,500)",
      "date": "2023",
      "awarder": "",
      "url": "",
      "summary": ""
    },
    {
      "title": "Louise McKinney Scholarship ($2,500)",
      "date": "2022",
      "awarder": "",
      "url": "",
      "summary": ""
    },
    {
      "title": "Schulich Leader Scholarship ($80,000)",
      "date": "2021",
      "awarder": "",
      "url": "",
      "summary": ""
    },
    {
      "title": "President's Admission Scholarship ($5,000)",
      "date": "2021",
      "awarder": "",
      "url": "",
      "summary": ""
    },
    {
      "title": "Alexander Rutherford Scholarship ($2,500)",
      "date": "2021",
      "awarder": "",
      "url": "",
      "summary": ""
    },
    {
      "title": "Arts and Science Honours Academy Entrance Scholarship ($1,000)",
      "date": "2021",
      "awarder": "",
      "url": "",
      "summary": ""
    },
    {
      "title": "Dean's List",
      "date": "2021-25",
      "awarder": "",
      "url": "",
      "summary": "4x Recipient"
    }
  ],
  "certificates": [],
  "publications": [
    {
      "name": "CRAWDAD: Causal Reasoning Augmentation with Dual-Agent Debate.",
      "publisher": "In International Conference on Autonomous Agents and Multiagent Systems. (Under review)",
      "releaseDate": "2025",
      "url": "",
      "summary": "Vamosi, F. G., & Forkert, N. D. (2025)."
    },
    {
      "name": "Synthetic Ground Truth Counterfactuals for Comprehensive Evaluation of Causal Generative Models in Medical Imaging.",
      "publisher": "In International Conference on Medical Image Computing and Computer-Assisted Intervention (pp. 541-550). Springer Nature Switzerland Cham.",
      "releaseDate": "2025",
      "url": "",
      "summary": "Stanley, E. A. M., Vigneshwaran, V., Ohara, E. Y., Vamosi, F. G., Forkert, N. D., & Wilms, M. (2025)."
    },
    {
      "name": "Dimensionality reduction in 3D causal deep learning for neuroimage generation: an evaluation study. Journal of Medical Imaging, 12(2), 024506-024506.",
      "publisher": "Journal of Medical Imaging",
      "releaseDate": "2025",
      "url": "",
      "summary": "Ohara, E. Y., Vigneshwaran, V., Souza, R., Vamosi, F. G., Wilms, M., & Forkert, N. D. (2025)."
    },
    {
      "name": "MACAW 3D: a masked causal normalizing flow method for counterfactual 3D brain image generation.",
      "publisher": "In Medical Imaging 2024: Imaging Informatics for Healthcare, Research, and Applications (Vol. 12931, pp. 110-115). SPIE.",
      "releaseDate": "2024",
      "url": "",
      "summary": "Ohara, E. Y., Vamosi, F., Patil, H., Vigneshwaran, V., Wilms, M., & Forkert, N. D. (2024)."
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "level": "",
      "icon": "",
      "keywords": [
        "English (Native)",
        "French (Fluent)"
      ]
    },
    {
      "name": "Programming",
      "level": "",
      "icon": "",
      "keywords": [
        "Python",
        "PyTorch",
        "Java",
        "R",
        "HTML",
        "CSS",
        "JavaScript",
        "Assembly",
        "Haskell"
      ]
    },
    {
      "name": "Software",
      "level": "",
      "icon": "",
      "keywords": [
        "Unreal Engine 4",
        "Unity",
        "Blender",
        "LaTeX",
        "Mathematica",
        "Unix",
        "Cluster Computing",
        "Excel",
        "Tableau"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native",
      "icon": ""
    },
    {
      "language": "French",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Research Interests",
      "icon": "",
      "keywords": [
        "Al alignment",
        "safety",
        "interpretability",
        "explainability",
        "fairness",
        "and robustness"
      ]
    }
  ],
  "references": [],
  "projects": [
    {
      "name": "Thesis Research, Dr. Tyler Bonnell",
      "summary": "University of Calgary, Faculty of Science. Project title: One-Life Reinforcement Learning in Naturalistic Environments",
      "highlights": [
        "Learned reinforcement learning theory from online courses and textbooks",
        "Compiled thorough literature review of associative learning as it relates to RL",
        "Implemented Gymnasium environment with environmental shaping and dynamism, making for a more naturalistic learning setup",
        "Adapted a novel associative learning formulation for continual learning",
        "Conducted several experiments of both standard and continual RL",
        "Wrote full research report and presentation, earning an A in the thesis course"
      ],
      "startDate": "2024",
      "endDate": "2025",
      "url": ""
    },
    {
      "name": "Research Assistant, Dr. Nils Forkert: CRAWDAD: Causal Reasoning Augmentation with Dual-Agent Debate",
      "summary": "University of Calgary, School of Medicine. Project title: CRAWDAD: Causal Reasoning Augmentation with Dual-Agent Debate",
      "highlights": [
        "Compiled thorough literature review of causality understanding in LLMs and multi-agent debate effectiveness across domains",
        "Set up DeepSeek-R1 and Qwen3 reasoning models using Ollama",
        "Constructed framework for both models to debate the answer to causal inference questions from the CLadder dataset",
        "Observed substantial increases in final answer accuracy after engaging in debate"
      ],
      "startDate": "2023",
      "endDate": "2025",
      "url": ""
    },
    {
      "name": "Research Assistant, Dr. Nils Forkert: Evaluating Causal Counterfactual Generation in Medical Imaging",
      "summary": "University of Calgary, School of Medicine. Project title: Evaluating Causal Counterfactual Generation in Medical Imaging",
      "highlights": [
        "Developed an experimental pipeline to assess causal machine learning models, such as the recently proposed MACAW",
        "Utilized the novel SimBA synthetic dataset generation tool to systematically and empirically evaluate MACAW's attempts at bias removal",
        "Employed PCA dimensionality reduction and trained the model in several components to reduce memory usage and accelerate model convergence",
        "Conducted quantitative analysis through MSE comparisons between image sets",
        "Trained a specialized CNN to assess counterfactual image quality and determine if MACAW had successfully removed the target bias",
        "Explored visual debugging techniques for identifying failure modes in causal medical image generation models"
      ],
      "startDate": "2023",
      "endDate": "2025",
      "url": ""
    },
    {
      "name": "Research Assistant, Dr. Nils Forkert: Deep Learning Age Prediction of Causally-Generated Brain Scans",
      "summary": "University of Calgary, School of Medicine. Project title: Deep Learning Age Prediction of Causally-Generated Brain Scans",
      "highlights": [
        "Filtered datasets to remove subjects with conditions affecting brain physiology to normalize training data",
        "Trained a machine learning model to accurately predict the ages of individuals based on their 2D or 3D brain MRI scans",
        "Accelerated training by configuring code to run on a remote computing cluster",
        "Presented the basics of Stable Diffusion to colleagues to introduce them to the new deep learning technique"
      ],
      "startDate": "2023",
      "endDate": "2025",
      "url": ""
    },
    {
      "name": "Research Assistant, Dr. Christian Jacob: Immersive Cell Biology Education in Virtual Reality",
      "summary": "University of Calgary, Faculty of Science. Project title: Immersive Cell Biology Education in Virtual Reality",
      "highlights": [
        "Developed an immersive virtual reality (VR) experience in Unreal Engine 4 for teaching cell biology in a memorable and approachable way",
        "Designed, edited, and animated unique 3D models in Blender for my project and those of other undergraduate students",
        "Developed an engaging VR game in which the player assumes the role of a Cytotoxic T cell in the bloodstream",
        "Implemented best practices of VR game development to reduce discomfort while playing and improve immersion"
      ],
      "startDate": "2019",
      "endDate": "2022",
      "url": ""
    }
  ]
}